Revit 2026 API

# RebarGetBendData Method

---

Gets the RebarBendData, containing bar and hook information, of the instance.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarBendData GetBendData()
```
```vb
Public Function GetBendData As RebarBendData
```
```cpp
public:
RebarBendData^ GetBendData()
```
```fsharp
member GetBendData : unit -> RebarBendData
```

#### Return Value

RebarBendData

Internally, the bend data is used by many RebarShape methods to generate shape geometry.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace